{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"C:/Users/daredevil/Documents/Code/samuel_site/src/blogs/2018-09-29 Journey to Design Matters/index.md absPath of file >>> MarkdownRemark","html":"<p><img src=\"./IMG_20180927_145719.jpg\"></p>\n<p>It was a truly enlightening trip to Denmark, attending Design Matters 2018 in Copenhagen (Sep 26 -27, 2018). Not only did the talks and workshops given by design practitioners across the industry are illuminating, but it had also made me realized to take a step back to reflect on the whole workflow of design process.</p>\n<h2>Design for feelings</h2>\n<p>One of the recurring theme during this year conference is the re-discovery of emotional design. Few speakers’ keynotes coincidentally brought up the importance of expressive design, while the utilitarian and minimal design has been dominated by industry leaders like Apple and Google. Tobias Ahlin from Minecraft stressed on the building emotionally engaging design style, that would eventually craft a distinctive voice for the brand. </p>\n<p>The question, “What are the key moments how your user feels” should also be addressed during the design process, aside from the quantitive approach, especially feelings are not measurable from data analysis. </p>\n<h2>Become a hybrid designer</h2>\n<div class=\"Gallery-50\">\n<img src=\"./static/IMG_20180927_131449-123d0e3d4741a1983a7171653ac6c165-2ed49.jpg\"></img>\n<img src=\"./static/IMG_20180927_135426-95ae3fc20f0dcfd3c956d7d3b002acbd-2ed49.jpg\"></img>\n</div>\n<p>Joining over 900 designers around the world, I’m also excited signing up two workshops, which were equally fun and inspiring, including \"Game Design\" workshop hosted by Dori Adar (Hands on Games) and \"New Hybrid Designer\" facilitated by McKinsey Design. </p>\n<p>One reason why I chose these two workshops was to getting myself familiar with the new aspect of the design, by introducing gamification to the design process and also talking about the business value of it.</p>\n<p>Becoming a hybrid designer has become truer in current days, in a sense that multi-discipline designers would be more communicative to make a pragmatic and sensible design choice. </p>\n<h2>Takeaways</h2>\n<p><img src=\"./IMG_20180926_183634.jpg\"> </p>\n<p>Making design happens takes more than a person or designers to be involved. Design values that we should uphold, the mindset of management and clients are also equally important in the design process to make it work. </p>\n<p>After intensive talks and workshops for two full days. This trip has been rewarding for myself to take a look at my own approach and position. Taking a step back to see the bigger picture would make the journey of design come clear. </p>","excerpt":"It was a truly enlightening trip to Denmark, attending Design Matters 2018 in Copenhagen (Sep 26 -27, 2018). Not only did the talks and workshops given by design practitioners across the industry are illuminating, but it had also made me realized to…","frontmatter":{"title":"Journey to Design Matters","date":"Sep 29, 2018","tags":["Design","Conference","DesignMatters18"],"path":"/journey-to-design-matters"}}},{"node":{"id":"C:/Users/daredevil/Documents/Code/samuel_site/src/blogs/2018-08-27 Why designers need a personal website/index.md absPath of file >>> MarkdownRemark","html":"<p>TLDR: I'm summing up the reasons why a designer should build a custom site using Gatsby.JS. </p>\n<p>One of my year resolution for 2018 is to learn front-end coding. I feel that being a designer, learning how to code is the way how I could step up the game in web design, by understanding how every bit and piece fall into places. </p>\n<p><img src=\"./Framev2.jpg\"></p>\n<p>I had two personal websites, one is my Tumblr and another is my portfolio site, separately hosted and running <a href=\"https://cargocollective.com/\">Cargo Collective</a>. But I was thinking, \"Wouldn't it be great if both of my portfolio and blog are together?\"</p>\n<h2>Why do you need a personal website?</h2>\n<p>It's 2018. Online presence is becoming the norm, even in the professional field. Your previous work, your side projects, even your work in progress matter. </p>\n<p>A personal site also means more control over your message and story, whether you're looking for new clients, landing a dream job or establishing a personal brand. For sure it takes more time and effort, but I think it is quite a good practice to sharpen your skill and catching up. Needless to say, making a personal site is much easier than a decade ago. </p>\n<p>While platforms like Medium, Facebook Pages are building homogeneous style for coherent browsing / reading experience. Your website should pursue personality instead. I'm not saying you shouldn't post to Medium publications or run a Facebook Page, but just not as the destination but a way to reach your very own website where you deliver your message. </p>\n<h2>What're my options?</h2>\n<p>Speaking of the BIG question, which platform should you choose? Wordpress is great for beginners since all settings are visible without dealing with code. But it was developed as a blogging platform, so it requires specific template in order to create a decent looking personal page. </p>\n<p>Website builder like <a href=\"https://webflow.com/?rfsn=1574887.557b84\">Webflow</a> and <a href=\"http://squarespace.com/\">Squarespace</a> is also an elegant option, but they adopt subscription model so the cost would be definitely higher.  </p>\n<p>After taking the <a href=\"http://designcode.io/\">Design+Code's</a> React course instructed by Meng To, I was introduced to <a href=\"https://www.gatsbyjs.org/\">Gatsby.JS</a>. After trying it out for few weeks, I genuinely rooting it as the up-and-coming personal website &#x26; blog option. Because:</p>\n<ol>\n<li>A custom personal website allows maximum creativity, a great advantage for designers.</li>\n<li>It's blaze-fast. Because all files are generated already. It also adopts modern web technology like React, Webpack and GraphQL. I compared the Lighthouse audit ran on beta site and current site. Performance has insanely improved.</li>\n<li>Gatsby is a static site generator, but dynamic data source is widely supported. Wordpress, Contentful or even Airtable can be used as a database. </li>\n<li>Deploying is as easy as drag-and-drop. <a href=\"http://netlify.com/\">Netlify</a> provides free hosting for static site, and Gatsby is free, meaning the project could be free as long as you have your own domain.</li>\n<li>Personal reason but a good one. <strong>I admit the process of making your own site is empowering.</strong> It's nice to not rely on anybody and build a website designed and developed all by yourself. I've been taking some screenshots logging daily progress, will share it later.</li>\n</ol>\n<h2>Last word</h2>\n<p>As Gatsby is quite new since it was first released a year ago. I wouldn't say current resources available is sufficient, but it is a strong and growing community. Most users are frontend web developer right now, but I'm optimistic to see more designers onboard.</p>\n<p>I admit there is indeed a learning curve to React, Gatsby and also GraphQL since I know fundamental HTML and CSS only. There were long nights that I was figuring out causes of errors, which turned out to be some stupid mistakes. </p>\n<p>I'm writing this also for my own future reference:</p>\n<blockquote>\n<p>A personal website should not only showcase your work, but also speak who you are and how you work.</p>\n</blockquote>\n<p>That's why I'm eager to share my work in progress, hoping to launch the site as soon as possible. </p>\n<h5>Reading List:</h5>\n<h5><a href=\"https://uxdesign.cc/things-i-honestly-dont-want-to-see-in-your-portfolio-3d3497666ca8\">Things I (honestly) don’t want to see in your portfolio</a></h5>","excerpt":"TLDR: I'm summing up the reasons why a designer should build a custom site using Gatsby.JS.  One of my year resolution for 2018 is to learn front-end coding. I feel that being a designer, learning how to code is the way how I could step up the game…","frontmatter":{"title":"Why designers need a personal website?","date":"Aug 26, 2018","tags":["Work In Progress","Design","Gatsby"],"path":"/why-designers-need-a-personal-website"}}},{"node":{"id":"C:/Users/daredevil/Documents/Code/samuel_site/src/blogs/2018-07-06 Color Tools/index.md absPath of file >>> MarkdownRemark","html":"<p>Color is the combination of science and art, a simple color change could have drastic effect on the emotion or perception of the viewer. Being a UI/UX designer, mastering the color theory and its application truly can step up your design game.</p>\n<p>Stephen Few’s <a href=\"https://www.perceptualedge.com/articles/ie/visual_perception.pdf\">“Tapping the Power of Visual Perception”</a> coined the term “Preattentive Attributes” in displaying data. Intensity and hue of color are two attributes that can enhance visual communication quickly. Leveraging color help users to process information, prioritize what they have seen, subsequently convert into actions. Same rule applies in designing social media graphics and user interfaces, using color intentionally reinforces the quality of design.\nHere are the best color tools you can use right now to create beautiful palettes and gradients for next design project.</p>\n<h2>1. Digital Color Meter (MacOS, Free)</h2>\n<p><img src=\"./2.jpg\"></p>\n<p>The most convenient app to grab color code is the one built-in to your Mac. Digital Color Meter is the default Mac utilities app hidden in your Application folder. The app does one job great, capture color as you point your cursor. Simply press Shift + Command + C will copy the value into the clipboard. You can also adjust color profile (native, sRGB, Adobe RGB or P3 etc.) as well as the values to display (sRGB hex code for me). To be honest, this free app probably satisfies most people’s need in picking color.</p>\n<p><img src=\"./3.gif\"></p>\n<p>Press “Command + L” to lock the inspectorYou can copy the RGB Hex Code easily by pressing “Shift + Command + S”</p>\n<p><img src=\"./4.gif\"></p>\n<h2>2. Sip (<a href=\"https://sipapp.io/?ref=todaydojo\">MacOS, USD$9.99</a> / <a href=\"https://setapp.com/get/sip?utm_medium=affiliate+program&#x26;utm_source=14&#x26;utm_campaign=sipapp.io\">Available on Setapp</a>)</h2>\n<p><img src=\"./5.jpg\"></p>\n<p>Consider Sip as the professional version of Digital Color Meter, it is the best color tool built  for pro-user in mind, providing seamless integration to professional workflows and applications. I love how it docks color palettes on top of the screen in a minimalist way, which allows cross-app usage.</p>\n<h2>3. Apple Human Interface Guidelines — Color (<a href=\"https://developer.apple.com/design/human-interface-guidelines/macos/visual-design/color/\">Web</a>, Free)</h2>\n<p>Color section of Apple’s Human Interface Guidelines is a great introductory piece for color design when you are designing websites and apps.</p>\n<h2>4. Adobe Capture CC (<a href=\"https://itunes.apple.com/us/app/adobe-capture-cc/id1040200189?mt=8&#x26;at=10lSkU\">iOS</a> &#x26; <a href=\"https://play.google.com/store/apps/details?id=com.adobe.creativeapps.gather\">Android</a>, Free)</h2>\n<p><img src=\"./6.png\"></p>\n<p>Capture photos and auto convert real-life hues into color palettes with Adobe Capture CC. It also directly integrates to your Adobe CC’s swatches if you are a subscriber.</p>\n<h2>5. Cone (<a href=\"https://itunes.apple.com/us/app/cone-live-color-picker/id1221305627?mt=8&#x26;at=10lSkU\">iOS</a>, USD$2.99)</h2>\n<p><img src=\"./7.jpg\"></p>\n<p>Cone is a beautiful and minimalistic color app that you can find on iOS App Store that allows user to capture Pantone colors in real-time. New version of the app has announced by the developer, stay tuned for the update.</p>\n<h2>6. Dribbble Colors (<a href=\"https://dribbble.com/colors/\">Web</a>, Free)</h2>\n<p><img src=\"./8.png\"></p>\n<p>Dribbble Colors is a hidden treasure for UI designers who are looking for case studies of color adoption. It allows users to search Dribbble shots by color using hex code. Users also can adjust percentage of the containing color within a shot. This tool comes handy to see how a color plays out in other design.</p>\n<h2>7. Coloors.co (<a href=\"http://coloors.co/?ref=todaydojo\">Web</a>, Free | iOS &#x26; Android, USD$1.99)</h2>\n<p><img src=\"./9.gif\"></p>\n<p>Coloors.co’s Color-blind Mode and Hue &#x26; Contrast Adjustment is user-friendly to fine tune your palette\nCoolors.co is a multi-color schemes generator, with a super-fast spacebar shortcut to generate color schemes instantly. Thoughtful features including colorblind mode, able to view shades and adjust hue and saturation have contributed it to be my favourite site for color inspiration. It also has paid upgrade for iOS App, Chrome Extension, and add-on for Adobe Creative Suite.</p>\n<h2>8. Paletton (<a href=\"http://www.paletton.com/?ref=todaydojo\">Web</a>, Free)</h2>\n<p><img src=\"./10.png\"></p>\n<p>Paletton takes on the scientific approach to find the right palette by adjacent and triad colors. It has plenty of previews and simulations to accommodate different scenarios for palette usage.</p>\n<h2>9. Webgradients (<a href=\"https://webgradients.com/?ref=todaydojo\">Web</a>, Free)</h2>\n<p><img src=\"./11.png\"></p>\n<p>Subtle color gradients collection made for website or app background. CSS code, PNG, Sketch and PSD previews are all set to use right away.</p>\n<h2>10. Social Colors (<a href=\"https://www.materialui.co/socialcolors\">Web</a>, Free)</h2>\n<p><img src=\"./12.png\"></p>\n<p>Material UI collects brand color for the major social media platform. Now you are one-click away from adopting the tone to your own customised banners and buttons.</p>\n<h2>11. Munsell Hue Test (<a href=\"http://www.colormunki.com/game/huetest_kiosk?ref=todaydojo\">Web</a>, Free)</h2>\n<p><img src=\"./13.png\"></p>\n<p>Train your eyesight to be laser-like. Munsell Hue Test is a fun yet challenging game to arrange color block by hue order. Lower the score is better.</p>\n<h2>12. Wave (<a href=\"http://wave.webaim.org/\">Web</a>, Free)</h2>\n<p>Access your website with web accessibility evaluation tool. The tool examines your site’s color contrast to meet WCAG2.0 AA and AAA standard.</p>\n<p>I hope the article covers your need in the design field, for color inspiration, palettes creation, and color accessibility. I have created a color resources collection in my personal project Today Dojo, which delivers the best-curated design resources for creators. If I have missed anything that should have made it to the list. Find me on <a href=\"http://www.twitter.com/desktopofsamuel\">Twitter</a> and let me know! </p>","excerpt":"Color is the combination of science and art, a simple color change could have drastic effect on the emotion or perception of the viewer. Being a UI/UX designer, mastering the color theory and its application truly can step up your design game…","frontmatter":{"title":"Essential Color Tools to Step Up Your Design Game","date":"Jul 06, 2018","tags":["Design","Productivity","Color"],"path":"/essential-color-tool-2018"}}}]}},"pageContext":{"tag":"Design"}}