{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"C:/Users/daredevil/Documents/Code/samuel_site/src/blogs/2018-07-06 Color Tools/index.md absPath of file >>> MarkdownRemark","html":"<p>Color is the combination of science and art, a simple color change could have drastic effect on the emotion or perception of the viewer. Being a UI/UX designer, mastering the color theory and its application truly can step up your design game.</p>\n<p>Stephen Few’s <a href=\"https://www.perceptualedge.com/articles/ie/visual_perception.pdf\">“Tapping the Power of Visual Perception”</a> coined the term “Preattentive Attributes” in displaying data. Intensity and hue of color are two attributes that can enhance visual communication quickly. Leveraging color help users to process information, prioritize what they have seen, subsequently convert into actions. Same rule applies in designing social media graphics and user interfaces, using color intentionally reinforces the quality of design.\nHere are the best color tools you can use right now to create beautiful palettes and gradients for next design project.</p>\n<h2>1. Digital Color Meter (MacOS, Free)</h2>\n<p><img src=\"./2.jpg\"></p>\n<p>The most convenient app to grab color code is the one built-in to your Mac. Digital Color Meter is the default Mac utilities app hidden in your Application folder. The app does one job great, capture color as you point your cursor. Simply press Shift + Command + C will copy the value into the clipboard. You can also adjust color profile (native, sRGB, Adobe RGB or P3 etc.) as well as the values to display (sRGB hex code for me). To be honest, this free app probably satisfies most people’s need in picking color.</p>\n<p><img src=\"./3.gif\"></p>\n<p>Press “Command + L” to lock the inspectorYou can copy the RGB Hex Code easily by pressing “Shift + Command + S”</p>\n<p><img src=\"./4.gif\"></p>\n<h2>2. Sip (<a href=\"https://sipapp.io/?ref=todaydojo\">MacOS, USD$9.99</a> / <a href=\"https://setapp.com/get/sip?utm_medium=affiliate+program&#x26;utm_source=14&#x26;utm_campaign=sipapp.io\">Available on Setapp</a>)</h2>\n<p><img src=\"./5.jpg\"></p>\n<p>Consider Sip as the professional version of Digital Color Meter, it is the best color tool built  for pro-user in mind, providing seamless integration to professional workflows and applications. I love how it docks color palettes on top of the screen in a minimalist way, which allows cross-app usage.</p>\n<h2>3. Apple Human Interface Guidelines — Color (<a href=\"https://developer.apple.com/design/human-interface-guidelines/macos/visual-design/color/\">Web</a>, Free)</h2>\n<p>Color section of Apple’s Human Interface Guidelines is a great introductory piece for color design when you are designing websites and apps.</p>\n<h2>4. Adobe Capture CC (<a href=\"https://itunes.apple.com/us/app/adobe-capture-cc/id1040200189?mt=8&#x26;at=10lSkU\">iOS</a> &#x26; <a href=\"https://play.google.com/store/apps/details?id=com.adobe.creativeapps.gather\">Android</a>, Free)</h2>\n<p><img src=\"./6.png\"></p>\n<p>Capture photos and auto convert real-life hues into color palettes with Adobe Capture CC. It also directly integrates to your Adobe CC’s swatches if you are a subscriber.</p>\n<h2>5. Cone (<a href=\"https://itunes.apple.com/us/app/cone-live-color-picker/id1221305627?mt=8&#x26;at=10lSkU\">iOS</a>, USD$2.99)</h2>\n<p><img src=\"./7.jpg\"></p>\n<p>Cone is a beautiful and minimalistic color app that you can find on iOS App Store that allows user to capture Pantone colors in real-time. New version of the app has announced by the developer, stay tuned for the update.</p>\n<h2>6. Dribbble Colors (<a href=\"https://dribbble.com/colors/\">Web</a>, Free)</h2>\n<p><img src=\"./8.png\"></p>\n<p>Dribbble Colors is a hidden treasure for UI designers who are looking for case studies of color adoption. It allows users to search Dribbble shots by color using hex code. Users also can adjust percentage of the containing color within a shot. This tool comes handy to see how a color plays out in other design.</p>\n<h2>7. Coloors.co (<a href=\"http://coloors.co/?ref=todaydojo\">Web</a>, Free | iOS &#x26; Android, USD$1.99)</h2>\n<p><img src=\"./9.gif\"></p>\n<p>Coloors.co’s Color-blind Mode and Hue &#x26; Contrast Adjustment is user-friendly to fine tune your palette\nCoolors.co is a multi-color schemes generator, with a super-fast spacebar shortcut to generate color schemes instantly. Thoughtful features including colorblind mode, able to view shades and adjust hue and saturation have contributed it to be my favourite site for color inspiration. It also has paid upgrade for iOS App, Chrome Extension, and add-on for Adobe Creative Suite.</p>\n<h2>8. Paletton (<a href=\"http://www.paletton.com/?ref=todaydojo\">Web</a>, Free)</h2>\n<p><img src=\"./10.png\"></p>\n<p>Paletton takes on the scientific approach to find the right palette by adjacent and triad colors. It has plenty of previews and simulations to accommodate different scenarios for palette usage.</p>\n<h2>9. Webgradients (<a href=\"https://webgradients.com/?ref=todaydojo\">Web</a>, Free)</h2>\n<p><img src=\"./11.png\"></p>\n<p>Subtle color gradients collection made for website or app background. CSS code, PNG, Sketch and PSD previews are all set to use right away.</p>\n<h2>10. Social Colors (<a href=\"https://www.materialui.co/socialcolors\">Web</a>, Free)</h2>\n<p><img src=\"./12.png\"></p>\n<p>Material UI collects brand color for the major social media platform. Now you are one-click away from adopting the tone to your own customised banners and buttons.</p>\n<h2>11. Munsell Hue Test (<a href=\"http://www.colormunki.com/game/huetest_kiosk?ref=todaydojo\">Web</a>, Free)</h2>\n<p><img src=\"./13.png\"></p>\n<p>Train your eyesight to be laser-like. Munsell Hue Test is a fun yet challenging game to arrange color block by hue order. Lower the score is better.</p>\n<h2>12. Wave (<a href=\"http://wave.webaim.org/\">Web</a>, Free)</h2>\n<p>Access your website with web accessibility evaluation tool. The tool examines your site’s color contrast to meet WCAG2.0 AA and AAA standard.</p>\n<p>I hope the article covers your need in the design field, for color inspiration, palettes creation, and color accessibility. I have created a color resources collection in my personal project Today Dojo, which delivers the best-curated design resources for creators. If I have missed anything that should have made it to the list. Find me on <a href=\"http://www.twitter.com/desktopofsamuel\">Twitter</a> and let me know! </p>","excerpt":"Color is the combination of science and art, a simple color change could have drastic effect on the emotion or perception of the viewer. Being a UI/UX designer, mastering the color theory and its application truly can step up your design game…","frontmatter":{"title":"Essential Color Tools to Step Up Your Design Game","date":"Jul 06, 2018","tags":["Design","Productivity","Color"],"path":"/essential-color-tool-2018"}}}]}},"pageContext":{"tag":"Color"}}